app/Services/AreasService.php

SELECT *
FROM "Areas"
WHERE "Areas"."id" = '4'
UPDATE "Areas" SET "nombre" = 'COORDINACION DE ASESORES', "clave_area" = '100100', "telefono_jefe" = '4520', "telefono_subjefe" = '', "telefono_secretaria" = '4520', "telefono_fax" = '4529', "fecha_alta" = '2004-09-14 00:00:00-05', "fecha_cambio" = NULL, "fecha_baja" = NULL, "activo" = 't', "facultado_modificacion" = '1'
WHERE "Areas"."id" IN ('4')
---
    public function ActualizarArea($datos){
        try{
            $idAreas = $datos->getVar('idAreas');
            $infoAreaActual = $this->miAreaModel->find($idAreas);
            $infoAreaActual->nombre = $datos->getVar('nombre_area');
            $infoAreaActual->clave_area = $datos->getVar('clave_areas');
            $infoAreaActual->telefono_jefe  = $datos->getVar('tel_jefe');
            $infoAreaActual->telefono_subjefe  = $datos->getVar('tel_subjefe');
            $infoAreaActual->telefono_secretaria  = $datos->getVar('tel_secret');
            $infoAreaActual->telefono_fax  = $datos->getVar('tel_fax');
            $nuevaInfo = $infoAreaActual;
            $this->miAreaModel->update($idAreas, $nuevaInfo);

SELECT *
FROM "Areas"
---
    public function GetAreas(){
        try{
            $areas = $this->miAreaModel->findAll();

SELECT *
FROM "Areas"
WHERE "Areas"."id" = '4'
---
    public function GetAreaByID($idAreas){
        $resultado['title'] = 'Error';
        $resultado['activo'] = false;
        $resultado['icon'] = 'error';
        try{
            $area = $this->miAreaModel->find($idAreas);