app/Services/NuevoUsuarioService.php

    public function GetUsuarios()
    {
        try {
            $usuarios = $this->miNuevoUsuarioModel->select('

            sprc_Facultados.*,
            Procuraduria.nombre AS procuraduriaNombre,
            perfil.nombre AS perfilnombre,
            A.nombre AS areanombre,
            FT.nombre AS tipoFacultado,
            ')


            ->join('ProcuraduriasNum Procuraduria', 'sprc_Facultados.numProcuraduriaID = Procuraduria.id', 'left')
            ->join('Perfiles perfil', 'sprc_Facultados.numPerfilId = perfil.id', 'left')
            ->join('Areas A', 'sprc_Facultados.strAreaId = A.id', 'left')
            ->join('FacultadoTipo FT', 'sprc_Facultados.numTipoFacultadoId = FT.id', 'left')
            ->get()->getResult();
---
SELECT "sprc_Facultados".*, "Procuraduria"."nombre" AS "procuraduriaNombre", "perfil"."nombre" AS "perfilnombre", "A"."nombre" AS "areanombre", "FT"."nombre" AS "tipoFacultado"
FROM "sprc_Facultados"
LEFT JOIN "ProcuraduriasNum" "Procuraduria" ON "sprc_Facultados"."numProcuraduriaID" = "Procuraduria"."id"
LEFT JOIN "Perfiles" "perfil" ON "sprc_Facultados"."numPerfilId" = "perfil"."id"
LEFT JOIN "Areas" "A" ON "sprc_Facultados"."strAreaId" = "A"."id"
LEFT JOIN "FacultadoTipo" "FT" ON "sprc_Facultados"."numTipoFacultadoId" = "FT"."id"